In [1]:
# pip install pymysql

In [2]:
name=input('what is your name?')

print(f'Pleased to meet you {name}')

age=int(input('How old are you?'))

if age >= 18:
    print(f'You are an adult, {name}')
else:
    print(f'you are a minor,{name}')

what is your name?Usman
Pleased to meet you Usman
How old are you?18
You are an adult, Usman

In [3]:
import mysql.connector
import pandas as pd

In [4]:
mydb=[]
def connection():
    host=input('Enter host')
    user=input('Enter User Name')
    passwd=input('passwd')
    database=input('database')
    global mydb
    mydb= mysql.connector.connect(host=host, user=user, passwd=passwd, database=database)
    return mydb
connection()

Enter hostlocalhost
Enter User Nameroot
passwd1234
databasesample_data

In [5]:
df=pd.read_sql_query('select * from sakila.actor', mydb)

In [6]:
df.head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

In [7]:
mydb